; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	image0 - mode
	infrared4 - mode
	infrared1 - mode
	thermograph2 - mode
	infrared3 - mode
	Star9 - direction
	GroundStation33 - direction
	Star13 - direction
	Star16 - direction
	Star0 - direction
	Star31 - direction
	Star8 - direction
	Star2 - direction
	GroundStation21 - direction
	Star37 - direction
	Star42 - direction
	Star35 - direction
	GroundStation36 - direction
	Star12 - direction
	Star39 - direction
	GroundStation28 - direction
	Star38 - direction
	Star23 - direction
	Star20 - direction
	GroundStation44 - direction
	GroundStation34 - direction
	GroundStation11 - direction
	GroundStation4 - direction
	Star14 - direction
	GroundStation47 - direction
	GroundStation15 - direction
	Star19 - direction
	GroundStation48 - direction
	GroundStation32 - direction
	Star3 - direction
	Star25 - direction
	Star30 - direction
	GroundStation22 - direction
	Star43 - direction
	Star49 - direction
	Star10 - direction
	GroundStation18 - direction
	Star45 - direction
	Star26 - direction
	Star46 - direction
	GroundStation17 - direction
	Star1 - direction
	GroundStation27 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star41 - direction
	GroundStation5 - direction
	Star40 - direction
	Star24 - direction
	GroundStation29 - direction
	Planet50 - direction
	Star51 - direction
	Phenomenon52 - direction
	Planet53 - direction
	Phenomenon54 - direction
	Phenomenon55 - direction
	Planet56 - direction
	Star57 - direction
	Phenomenon58 - direction
	Planet59 - direction
	Star60 - direction
	Planet61 - direction
	Star62 - direction
	Phenomenon63 - direction
	Planet64 - direction
	Planet65 - direction
	Star66 - direction
	Phenomenon67 - direction
	Phenomenon68 - direction
	Phenomenon69 - direction
	Planet70 - direction
	Phenomenon71 - direction
	Phenomenon72 - direction
	Phenomenon73 - direction
	Phenomenon74 - direction
	Star75 - direction
	Phenomenon76 - direction
	Planet77 - direction
	Planet78 - direction
	Phenomenon79 - direction
	Planet80 - direction
	Planet81 - direction
	Planet82 - direction
	Planet83 - direction
	Planet84 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star45)
	(calibration_target instrument0 Star41)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation18)
	(calibration_target instrument0 Star20)
	(calibration_target instrument0 GroundStation21)
	(calibration_target instrument0 Star43)
	(calibration_target instrument0 Star31)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 Star37)
	(supports instrument1 infrared3)
	(supports instrument1 infrared1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star31)
	(calibration_target instrument1 Star39)
	(calibration_target instrument1 Star49)
	(calibration_target instrument1 GroundStation47)
	(calibration_target instrument1 GroundStation28)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star43)
	(calibration_target instrument1 GroundStation22)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation32)
	(calibration_target instrument1 GroundStation36)
	(calibration_target instrument1 Star16)
	(calibration_target instrument1 GroundStation17)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon67)
	(supports instrument2 infrared4)
	(calibration_target instrument2 Star46)
	(calibration_target instrument2 Star26)
	(calibration_target instrument2 Star38)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 GroundStation21)
	(calibration_target instrument2 GroundStation36)
	(calibration_target instrument2 Star49)
	(calibration_target instrument2 Star39)
	(calibration_target instrument2 Star20)
	(calibration_target instrument2 Star23)
	(calibration_target instrument2 Star35)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 Star45)
	(calibration_target instrument2 Star24)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet65)
	(supports instrument3 infrared3)
	(supports instrument3 infrared1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation47)
	(calibration_target instrument3 Star38)
	(supports instrument4 infrared3)
	(supports instrument4 infrared4)
	(calibration_target instrument4 GroundStation44)
	(calibration_target instrument4 GroundStation48)
	(calibration_target instrument4 GroundStation29)
	(calibration_target instrument4 Star25)
	(calibration_target instrument4 Star35)
	(calibration_target instrument4 GroundStation15)
	(calibration_target instrument4 Star40)
	(calibration_target instrument4 Star42)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star43)
	(calibration_target instrument4 Star14)
	(calibration_target instrument4 Star26)
	(calibration_target instrument4 GroundStation34)
	(calibration_target instrument4 Star37)
	(supports instrument5 infrared4)
	(supports instrument5 image0)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 Star24)
	(calibration_target instrument5 GroundStation48)
	(calibration_target instrument5 Star26)
	(calibration_target instrument5 Star49)
	(calibration_target instrument5 Star41)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 Star38)
	(calibration_target instrument5 Star14)
	(calibration_target instrument5 Star12)
	(calibration_target instrument5 GroundStation36)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star45)
	(supports instrument6 image0)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star20)
	(calibration_target instrument6 GroundStation27)
	(calibration_target instrument6 Star1)
	(calibration_target instrument6 Star23)
	(calibration_target instrument6 Star38)
	(calibration_target instrument6 Star40)
	(calibration_target instrument6 GroundStation15)
	(calibration_target instrument6 Star26)
	(calibration_target instrument6 GroundStation28)
	(calibration_target instrument6 Star39)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star75)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation48)
	(calibration_target instrument7 Star19)
	(calibration_target instrument7 GroundStation15)
	(calibration_target instrument7 Star24)
	(calibration_target instrument7 GroundStation47)
	(calibration_target instrument7 Star14)
	(calibration_target instrument7 Star10)
	(calibration_target instrument7 Star30)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 GroundStation11)
	(calibration_target instrument7 GroundStation34)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 GroundStation44)
	(supports instrument8 infrared3)
	(calibration_target instrument8 Star3)
	(calibration_target instrument8 GroundStation32)
	(supports instrument9 thermograph2)
	(supports instrument9 infrared1)
	(supports instrument9 infrared3)
	(calibration_target instrument9 GroundStation7)
	(calibration_target instrument9 GroundStation6)
	(calibration_target instrument9 GroundStation27)
	(calibration_target instrument9 Star1)
	(calibration_target instrument9 GroundStation17)
	(calibration_target instrument9 Star46)
	(calibration_target instrument9 Star26)
	(calibration_target instrument9 Star45)
	(calibration_target instrument9 Star40)
	(calibration_target instrument9 GroundStation18)
	(calibration_target instrument9 Star10)
	(calibration_target instrument9 Star49)
	(calibration_target instrument9 Star43)
	(calibration_target instrument9 GroundStation22)
	(calibration_target instrument9 Star30)
	(calibration_target instrument9 Star25)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star39)
	(supports instrument10 infrared1)
	(calibration_target instrument10 Star40)
	(calibration_target instrument10 GroundStation5)
	(calibration_target instrument10 Star41)
	(supports instrument11 thermograph2)
	(supports instrument11 infrared4)
	(supports instrument11 infrared1)
	(calibration_target instrument11 GroundStation29)
	(calibration_target instrument11 Star24)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet64)
)
(:goal (and
	(pointing satellite1 GroundStation48)
	(have_image Planet50 thermograph2)
	(have_image Star51 infrared1)
	(have_image Phenomenon52 infrared1)
	(have_image Planet53 infrared3)
	(have_image Phenomenon54 thermograph2)
	(have_image Phenomenon55 thermograph2)
	(have_image Planet56 image0)
	(have_image Star57 thermograph2)
	(have_image Phenomenon58 infrared4)
	(have_image Planet59 infrared1)
	(have_image Star60 image0)
	(have_image Planet61 infrared1)
	(have_image Star62 infrared1)
	(have_image Phenomenon63 image0)
	(have_image Planet64 infrared4)
	(have_image Planet65 thermograph2)
	(have_image Star66 infrared4)
	(have_image Phenomenon67 image0)
	(have_image Phenomenon68 thermograph2)
	(have_image Phenomenon69 infrared4)
	(have_image Planet70 infrared3)
	(have_image Phenomenon71 infrared3)
	(have_image Phenomenon72 infrared4)
	(have_image Phenomenon73 infrared3)
	(have_image Phenomenon74 image0)
	(have_image Star75 infrared4)
	(have_image Phenomenon76 infrared3)
	(have_image Planet77 thermograph2)
	(have_image Planet78 infrared4)
	(have_image Phenomenon79 infrared4)
	(have_image Planet80 image0)
	(have_image Planet81 infrared1)
	(have_image Planet82 infrared1)
	(have_image Planet83 infrared3)
	(have_image Planet84 infrared4)
))

)

; plan
1. (switch_on instrument11 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument11)
   goals met: 0 of 36
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 36
3. (turn_to satellite1 groundstation48 planet65)
   deleted: (pointing satellite1 planet65)
   added: (pointing satellite1 groundstation48)
   goals met: 1 of 36
4. (turn_to satellite4 star24 planet64)
   deleted: (pointing satellite4 planet64)
   added: (pointing satellite4 star24)
   goals met: 1 of 36
5. (calibrate satellite4 instrument11 star24)
   added: (calibrated instrument11)
   goals met: 1 of 36
6. (turn_to satellite4 phenomenon52 star24)
   deleted: (pointing satellite4 star24)
   added: (pointing satellite4 phenomenon52)
   goals met: 1 of 36
7. (take_image satellite4 phenomenon52 instrument11 infrared1)
   added: (have_image phenomenon52 infrared1)
   goals met: 2 of 36
8. (turn_to satellite4 phenomenon54 phenomenon52)
   deleted: (pointing satellite4 phenomenon52)
   added: (pointing satellite4 phenomenon54)
   goals met: 2 of 36
9. (take_image satellite4 phenomenon54 instrument11 thermograph2)
   added: (have_image phenomenon54 thermograph2)
   goals met: 3 of 36
10. (turn_to satellite4 phenomenon55 phenomenon54)
   deleted: (pointing satellite4 phenomenon54)
   added: (pointing satellite4 phenomenon55)
   goals met: 3 of 36
11. (take_image satellite4 phenomenon55 instrument11 thermograph2)
   added: (have_image phenomenon55 thermograph2)
   goals met: 4 of 36
12. (turn_to satellite4 phenomenon58 phenomenon55)
   deleted: (pointing satellite4 phenomenon55)
   added: (pointing satellite4 phenomenon58)
   goals met: 4 of 36
13. (take_image satellite4 phenomenon58 instrument11 infrared4)
   added: (have_image phenomenon58 infrared4)
   goals met: 5 of 36
14. (turn_to satellite4 phenomenon68 phenomenon58)
   deleted: (pointing satellite4 phenomenon58)
   added: (pointing satellite4 phenomenon68)
   goals met: 5 of 36
15. (take_image satellite4 phenomenon68 instrument11 thermograph2)
   added: (have_image phenomenon68 thermograph2)
   goals met: 6 of 36
16. (turn_to satellite4 phenomenon69 phenomenon68)
   deleted: (pointing satellite4 phenomenon68)
   added: (pointing satellite4 phenomenon69)
   goals met: 6 of 36
17. (take_image satellite4 phenomenon69 instrument11 infrared4)
   added: (have_image phenomenon69 infrared4)
   goals met: 7 of 36
18. (turn_to satellite4 phenomenon72 phenomenon69)
   deleted: (pointing satellite4 phenomenon69)
   added: (pointing satellite4 phenomenon72)
   goals met: 7 of 36
19. (take_image satellite4 phenomenon72 instrument11 infrared4)
   added: (have_image phenomenon72 infrared4)
   goals met: 8 of 36
20. (turn_to satellite4 phenomenon79 phenomenon72)
   deleted: (pointing satellite4 phenomenon72)
   added: (pointing satellite4 phenomenon79)
   goals met: 8 of 36
21. (take_image satellite4 phenomenon79 instrument11 infrared4)
   added: (have_image phenomenon79 infrared4)
   goals met: 9 of 36
22. (turn_to satellite4 planet50 phenomenon79)
   deleted: (pointing satellite4 phenomenon79)
   added: (pointing satellite4 planet50)
   goals met: 9 of 36
23. (take_image satellite4 planet50 instrument11 thermograph2)
   added: (have_image planet50 thermograph2)
   goals met: 10 of 36
24. (turn_to satellite4 planet59 planet50)
   deleted: (pointing satellite4 planet50)
   added: (pointing satellite4 planet59)
   goals met: 10 of 36
25. (take_image satellite4 planet59 instrument11 infrared1)
   added: (have_image planet59 infrared1)
   goals met: 11 of 36
26. (turn_to satellite4 planet61 planet59)
   deleted: (pointing satellite4 planet59)
   added: (pointing satellite4 planet61)
   goals met: 11 of 36
27. (take_image satellite4 planet61 instrument11 infrared1)
   added: (have_image planet61 infrared1)
   goals met: 12 of 36
28. (turn_to satellite4 planet64 planet61)
   deleted: (pointing satellite4 planet61)
   added: (pointing satellite4 planet64)
   goals met: 12 of 36
29. (take_image satellite4 planet64 instrument11 infrared4)
   added: (have_image planet64 infrared4)
   goals met: 13 of 36
30. (turn_to satellite4 planet65 planet64)
   deleted: (pointing satellite4 planet64)
   added: (pointing satellite4 planet65)
   goals met: 13 of 36
31. (take_image satellite4 planet65 instrument11 thermograph2)
   added: (have_image planet65 thermograph2)
   goals met: 14 of 36
32. (turn_to satellite4 planet77 planet65)
   deleted: (pointing satellite4 planet65)
   added: (pointing satellite4 planet77)
   goals met: 14 of 36
33. (take_image satellite4 planet77 instrument11 thermograph2)
   added: (have_image planet77 thermograph2)
   goals met: 15 of 36
34. (turn_to satellite4 planet78 planet77)
   deleted: (pointing satellite4 planet77)
   added: (pointing satellite4 planet78)
   goals met: 15 of 36
35. (take_image satellite4 planet78 instrument11 infrared4)
   added: (have_image planet78 infrared4)
   goals met: 16 of 36
36. (turn_to satellite4 planet81 planet78)
   deleted: (pointing satellite4 planet78)
   added: (pointing satellite4 planet81)
   goals met: 16 of 36
37. (take_image satellite4 planet81 instrument11 infrared1)
   added: (have_image planet81 infrared1)
   goals met: 17 of 36
38. (turn_to satellite4 planet82 planet81)
   deleted: (pointing satellite4 planet81)
   added: (pointing satellite4 planet82)
   goals met: 17 of 36
39. (take_image satellite4 planet82 instrument11 infrared1)
   added: (have_image planet82 infrared1)
   goals met: 18 of 36
40. (turn_to satellite4 planet84 planet82)
   deleted: (pointing satellite4 planet82)
   added: (pointing satellite4 planet84)
   goals met: 18 of 36
41. (take_image satellite4 planet84 instrument11 infrared4)
   added: (have_image planet84 infrared4)
   goals met: 19 of 36
42. (turn_to satellite4 star51 planet84)
   deleted: (pointing satellite4 planet84)
   added: (pointing satellite4 star51)
   goals met: 19 of 36
43. (take_image satellite4 star51 instrument11 infrared1)
   added: (have_image star51 infrared1)
   goals met: 20 of 36
44. (turn_to satellite4 star57 star51)
   deleted: (pointing satellite4 star51)
   added: (pointing satellite4 star57)
   goals met: 20 of 36
45. (take_image satellite4 star57 instrument11 thermograph2)
   added: (have_image star57 thermograph2)
   goals met: 21 of 36
46. (turn_to satellite4 star62 star57)
   deleted: (pointing satellite4 star57)
   added: (pointing satellite4 star62)
   goals met: 21 of 36
47. (take_image satellite4 star62 instrument11 infrared1)
   added: (have_image star62 infrared1)
   goals met: 22 of 36
48. (turn_to satellite4 star66 star62)
   deleted: (pointing satellite4 star62)
   added: (pointing satellite4 star66)
   goals met: 22 of 36
49. (take_image satellite4 star66 instrument11 infrared4)
   added: (have_image star66 infrared4)
   goals met: 23 of 36
50. (turn_to satellite4 star75 star66)
   deleted: (pointing satellite4 star66)
   added: (pointing satellite4 star75)
   goals met: 23 of 36
51. (take_image satellite4 star75 instrument11 infrared4)
   added: (have_image star75 infrared4)
   goals met: 24 of 36
52. (turn_to satellite0 star8 phenomenon67)
   deleted: (pointing satellite0 phenomenon67)
   added: (pointing satellite0 star8)
   goals met: 24 of 36
53. (calibrate satellite0 instrument1 star8)
   added: (calibrated instrument1)
   goals met: 24 of 36
54. (turn_to satellite0 phenomenon63 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon63)
   goals met: 24 of 36
55. (take_image satellite0 phenomenon63 instrument1 image0)
   added: (have_image phenomenon63 image0)
   goals met: 25 of 36
56. (turn_to satellite0 phenomenon67 phenomenon63)
   deleted: (pointing satellite0 phenomenon63)
   added: (pointing satellite0 phenomenon67)
   goals met: 25 of 36
57. (take_image satellite0 phenomenon67 instrument1 image0)
   added: (have_image phenomenon67 image0)
   goals met: 26 of 36
58. (turn_to satellite0 phenomenon71 phenomenon67)
   deleted: (pointing satellite0 phenomenon67)
   added: (pointing satellite0 phenomenon71)
   goals met: 26 of 36
59. (take_image satellite0 phenomenon71 instrument1 infrared3)
   added: (have_image phenomenon71 infrared3)
   goals met: 27 of 36
60. (turn_to satellite0 phenomenon73 phenomenon71)
   deleted: (pointing satellite0 phenomenon71)
   added: (pointing satellite0 phenomenon73)
   goals met: 27 of 36
61. (take_image satellite0 phenomenon73 instrument1 infrared3)
   added: (have_image phenomenon73 infrared3)
   goals met: 28 of 36
62. (turn_to satellite0 phenomenon74 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 phenomenon74)
   goals met: 28 of 36
63. (take_image satellite0 phenomenon74 instrument1 image0)
   added: (have_image phenomenon74 image0)
   goals met: 29 of 36
64. (turn_to satellite0 phenomenon76 phenomenon74)
   deleted: (pointing satellite0 phenomenon74)
   added: (pointing satellite0 phenomenon76)
   goals met: 29 of 36
65. (take_image satellite0 phenomenon76 instrument1 infrared3)
   added: (have_image phenomenon76 infrared3)
   goals met: 30 of 36
66. (turn_to satellite0 planet53 phenomenon76)
   deleted: (pointing satellite0 phenomenon76)
   added: (pointing satellite0 planet53)
   goals met: 30 of 36
67. (take_image satellite0 planet53 instrument1 infrared3)
   added: (have_image planet53 infrared3)
   goals met: 31 of 36
68. (turn_to satellite0 planet56 planet53)
   deleted: (pointing satellite0 planet53)
   added: (pointing satellite0 planet56)
   goals met: 31 of 36
69. (take_image satellite0 planet56 instrument1 image0)
   added: (have_image planet56 image0)
   goals met: 32 of 36
70. (turn_to satellite0 planet70 planet56)
   deleted: (pointing satellite0 planet56)
   added: (pointing satellite0 planet70)
   goals met: 32 of 36
71. (take_image satellite0 planet70 instrument1 infrared3)
   added: (have_image planet70 infrared3)
   goals met: 33 of 36
72. (turn_to satellite0 planet80 planet70)
   deleted: (pointing satellite0 planet70)
   added: (pointing satellite0 planet80)
   goals met: 33 of 36
73. (take_image satellite0 planet80 instrument1 image0)
   added: (have_image planet80 image0)
   goals met: 34 of 36
74. (turn_to satellite0 planet83 planet80)
   deleted: (pointing satellite0 planet80)
   added: (pointing satellite0 planet83)
   goals met: 34 of 36
75. (take_image satellite0 planet83 instrument1 infrared3)
   added: (have_image planet83 infrared3)
   goals met: 35 of 36
76. (turn_to satellite0 star60 planet83)
   deleted: (pointing satellite0 planet83)
   added: (pointing satellite0 star60)
   goals met: 35 of 36
77. (take_image satellite0 star60 instrument1 image0)
   added: (have_image star60 image0)
   goals met: 36 of 36
